/*
Напишите программу, которая в последовательности натуральных чисел определяет максимальное число, кратное 5.
Программа получает на вход количество чисел в последовательности, а затем сами числа.
В последовательности всегда имеется число, кратное 5.
Количество чисел не превышает 1000. Введённые числа не превышают 30 000. 
Программа должна вывести одно число — максимальное число, кратное 5.
*/

#inlude <iostream>

using namespace std;

int main()
{
	int number;
	int max = INT_MIN;
	int amout;
	
	cin >> amout;
	for (int i = 0; i < amout; ++i)
	{
		cin >> number;
		if (number > max && number % 5 = 0)
		{
			max = number;
		}
    }
	cout << max;
	return 0; 
}