/*
Напишите программу, которая в последовательности натуральных чисел определяет сумму чисел, кратных 6.
Программа получает на вход количество чисел в последовательности, а затем сами числа.
В последовательности всегда имеется число, кратное 6. Количество чисел не превышает 100. Введённые числа не превышают 300.
Программа должна вывести одно число — сумму чисел, кратных 6.
*/

#inlude <iostream>

using namespace std;

int main()
{
	int number;
	int amout;
	int sum = 0;
	
	cin >> amout;
	for (int i = 0; i < amout; ++i)
	{
		cin >> number;
		if (number % 6 == 0)
		{
			sum += number;
		}
    }
	cout << sum;
	return 0; 
}