/*
Напишите программу, которая в последовательности натуральных чисел определяет количество чисел, кратных 
4. Программа получает на вход количество чисел в последовательности, а затем сами числа. В последовательности всегда имеется число, кратное 
4. Количество чисел не превышает 1000. Введённые числа не превышают 30 000. Программа должна вывести одно число — количество чисел, кратных 4.
*/

#inlude <iostream>

using namespace std;

int main()
{
	int number;
	int amout;
	int amountOf4 = 0;
	
	cin >> amout;
	for (int i = 0; i < amout; ++i)
	{
		cin >> number;
		if (number % 4 == 0)
		{
			++amoutOf4;
		}
    }
	cout << amoutOf4;
	return 0; 
}