/*
Напишите программу, которая в последовательности натуральных чисел определяет минимальное число, кратное 3. 
Программа получает на вход количество чисел в последовательности, а затем сами числа. В последовательности всегда имеется число, кратное 3.
 Количество чисел не превышает 1000.
 Введённые числа не превышают 30 000. Программа должна вывести одно число — минимальное число, кратное 3.
*/

#inlude <iostream>

using namespace std;

int main()
{
	int number;
	int amout;
	int min = INT_MAX;
	
	cin >> amout;
	for (int i = 0; i < amout; ++i)
	{
		cin >> number;
		if (number < min && number % 3 == 0)
		{
			min = number;
		}
    }
	cout << min;
	return 0; 
}