/*
 Напишите программу, которая в последовательности целых чисел определяет их сумму и подсчитывает разность количества положительных и
 отрицательных чисел последовательности. 
 Программа получает на вход целые числа, количество введённых чисел неизвестно, последовательность чисел заканчивается числом 0 
 (0 — признак окончания ввода, не входит в последовательность).
Количество чисел не превышает 1000. Введённые числа по модулю не превышают 30 000. Программа должна вывести два числа:
сумму чисел и разность количества положительных и отрицательных чисел.
*/

#include <iostream>

using namespace std;

int main()
{
    int number;
    int amountOfPositive = 0;
    int amountOfNegative = 0;
    int sum = 0;

    cin >> number;
    while (number != 0)
    {
        sum += number;

        if (number > 0)
        {
            ++amountOfPositive;
        }

        if (number < 0)
        {
            ++amountOfNegative;
        }

        cin >> number;
    }

    cout << sum << endl << amountOfPositive - amountOfNegative;
	
    return 0;
}
