/*
Напишите программу, которая в последовательности натуральных чисел определяет сумму всех чисел, кратных 7 и оканчивающихся на 3.
Программа получает на вход натуральные числа, количество введённых чисел неизвестно, последовательность чисел заканчивается числом 0
(0 — признак окончания ввода, не входит в последовательность). Количество чисел не превышает 100. Введённые числа не превышают 300.
Программа должна вывести одно число: сумму всех чисел, кратных 7 и оканчивающихся на 3.
*/

#include <iostream>

using namespace std;

	int main()
    {
        int number;
        int sumOf7 = 0;
        cin >> number;

        while (number != 0)
        {
            if (number % 7 == 0 && number % 10 == 3)
            {
                sumOf7 += number;
            }
         cin >> number;
        }
        cout << sumOf7;

    return 0;
    }