/*
Напишите программу, которая в последовательности натуральных чисел определяет минимальное число, оканчивающееся на 4.
Программа получает на вход количество чисел в последовательности, а затем сами числа. В последовательности всегда имеется число, оканчивающееся на 4.
Количество чисел не превышает 1000. Введённые числа не превышают 30 000. Программа должна вывести одно число — минимальное число, оканчивающееся на 4.


*/

#include <iostream>

using namespace std;

	int main()
    {
        int amount;
        int number;
        int min = 30001;
        
        cin >> amount;
        for (int i = 0; i < amount; i++)
        {
            cin >> number;
            if (number < min && number % 10 == 4)
            {
                min = number;
            }
        }
        cout << min;

    return 0;
    }
