/*
 Напишите программу, которая в последовательности натуральных чисел определяет количество однозначных чисел, кратных 3.
 Программа получает на вход натуральные числа, количество введённых чисел неизвестно, последовательность чисел заканчивается 0
 (0 — признак окончания ввода, не входит в последовательность). Количество чисел 1000. 
 Введённые числе не превышают 30 000. Программа должна вывести одно число: количество однозначных чисел, кратных 3.
*/

#include <iostream>

using namespace std;

	int main()
    {
        int number;
        int answer3 = 0;

        cin >> number;
        while (number != 0)
        {
            if (number < 10 && number % 3 == 0)
            {
                ++answer3;
            }
            cin >> number;
        }
        cout << answer3;

    return 0;
    }