/*
Напишите программу, которая в последовательности натуральных чисел определяет количество всех чётных чисел, кратных 9
Программа получает на вход натуральные числа, количество введённых чисел неизвестно, последовательность чисел заканчивается числом 0 
(0 — признак окончания ввода, не входит в последовательность). Количество чисел не превышает 1000. Введённые числа не превышают 30 000.
Программа должна вывести одно число: количество всех чётных чисел, кратных 9.
*/

#include <iostream>

using namespace std;

	int main()
    {
        int number;
        int answer9 = 0;

        cin >> number;
        while (number != 0)
        {
            if (number % 2 == 0 && number % 9 == 0)
            {
                ++answer9;
            }
            cin >> number;
        }
        cout << answer9;

    return 0;
    }