/*
Напишите программу для решения следующей задачи. Ученики 4 класса вели дневники наблюдения за погодой и ежедневно записывали дневную температуру.
Найдите самую низкую температуру за время наблюдения. Если температура опускалась ниже –15 градусов, выведите YES, иначе выведите NO.
Программа получает на вход количество дней, в течение которых проводилось измерение температуры N (1 ≤ N ≤ 31),
затем для каждого дня вводится температура.
*/

#include <iostream>

using namespace std;

	int main()
    {
        int amount;
        int number;
        int temp15 = 0;
        int mintemp = INT_MAX;

        cin >> amount;
        for (int i = 0; i < amount; i++)
        {
            cin >> number;
            if (number < -15)
            {
                ++temp15;
            }
            if (number < mintemp)
            {
                mintemp = number;
            }
        }
        if (temp15 > 0)
        {
            cout << mintemp << endl << "YES";
        }
        else
        {
            cout << mintemp << endl << "NO";
        }

    return 0;
    }