/*
Напишите программу, которая в последовательности натуральных чисел определяет определяет сумму всех чисел, кратных 6 и оканчивающихся на 4.
Программа получает на вход натуральные числа, количество введённых чисел неизвестно, последовательность чисел заканчивается числом 0 
(0 — признак окончания ввода, не входит в последовательность). Количество чисел не превышает 1000. Введённые числа не превышают 30 000.
Программа должна вывести одно число: сумму всех чисел, кратных 6 и оканчивающихся на 4.
*/

#include <iostream>

using namespace std;

int main()
{
	int number;
	int sum = 0;

	cin >> number;
	while (number != 0)
	{
		if (number % 6 == 0 && number % 10 == 4)
		{
			sum += number;
		}

		cin >> number;
	}

	cout << sum;
	return 0;
}
