/*
 Напишите программу для решения следующей задачи. Камера наблюдения регистрирует в автоматическом режиме скорость проезжающих мимо неё автомобилей, округляя
 значения скорости до целых чисел. Необходимо определить
 максимальную зарегистрированную скорость автомобиля. Если скорость хотя бы одного автомобиля была меньше 30 км/ч, выведите «YES», иначе выведите «N0».
Программа получает на вход число проехавших автомобилей N (1 < N < 30), затем указываются их скорости. Значение скорости не может быть меньше 1 и больше 300.
Программа должна сначала вывести максимальную скорость, затем YES или NO.
*/

#include <iostream>

using namespace std;

int main()
{
	int amount;
	int amountOfLessThan30 = 0;
	int speed;
	int maxSpeed = 0;

	cin >> amount;
	for (int i = 0; i < amount; i++)
	{
		cin >> speed;
		
		if (speed < 30)
		{
			++amountOfLessThan30;
		}
		
		if (speed > maxSpeed)
		{
			maxSpeed = speed;
		}
	}

	if (amountOfLessThan30 > 0)
	{
		cout << maxSpeed << endl << "YES";
	}
	else
	{
		cout << maxSpeed << endl << "NO";
	}

	return 0;
}
