/*
 Напишите программу для решения следующей задачи. Камера наблюдения регистрирует в автоматическом режиме скорость проезжающих мимо неё автомобилей,
 округляя значения скорости до целых чисел. Необходимо определить минимальную
 зарегистрированную скорость автомобиля. Если скорость хотя бы одного автомобиля была больше 80 км/ч, выведите «YES», иначе выведите «NO».
Программа получает на вход число проехавших автомобилей N (1 ≤ N ≤ 30), затем указываются их скорости. Значение скорости не может быть меньше 1 и больше 300.
Программа должна сначала вывести минимальную скорость, затем YES или NO.
*/

#include <iostream>

using namespace std;

int main()
{
	int amount;
	int amountOfLessThan80 = 0;
	int speed;
	int minSpeed = 301;

	cin >> amount;
	for (int i = 0; i < amount; i++)
	{
		cin >> speed;
		
		if (speed > 80)
		{
			++amountOfLessThan80;
		}
		
		if (speed < minSpeed)
		{
			minSpeed = speed;
		}
	}

	if (amountOfLessThan80 > 0)
	{
		cout << minSpeed << endl << "YES";
	}
	else
	{
		cout << minSpeed << endl << "NO";
	}

	return 0;
}
